In [1]:
import pandas as pd
# Load libraries
import pandas
from pandas.plotting import scatter_matrix
import matplotlib.pyplot as plt
from sklearn import model_selection
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.discriminant_analysis import LinearDiscriminantAnalysis
from sklearn.naive_bayes import GaussianNB
from sklearn.svm import SVC

In [2]:
import numpy as np

In [3]:
train=pd.read_csv("train.csv")

In [4]:
test=pd.read_csv("test.csv")

In [5]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [7]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [8]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [9]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [10]:
test.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [11]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [12]:
train.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C

In [13]:

train['Age'].fillna(method='ffill',inplace=True)
test['Age'].fillna(method='ffill',inplace=True)
train['Cabin'].fillna(method='bfill',inplace=True)
test['Cabin'].fillna(method='bfill',inplace=True)
train['Embarked'].fillna(method='ffill',inplace=True)
test['Fare'].fillna(method='ffill',inplace=True)

In [14]:
train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          1
Embarked       0
dtype: int64

In [15]:
test.isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          3
Embarked       0
dtype: int64

In [16]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C85,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C123,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,E46,S

In [17]:
train.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.026653,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.065571,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.291157,0.083081,0.018443,-0.549500
Age,0.026653,-0.065571,-0.291157,1.000000,-0.206104,-0.165191,0.083417
SibSp,-0.057527,-0.035322,0.083081,-0.206104,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.165191,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.083417,0.159651,0.216225,1.000000

In [18]:

cv=train.dtypes.loc[train.dtypes=='object'].index
cv

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [19]:
train[cv].apply(lambda x: len(x.unique()))

Name        891
Sex           2
Ticket      681
Cabin       148
Embarked      3
dtype: int64

In [20]:
#train['Ticket'].value_counts()/train.shape[0]

In [21]:
#train=train.drop('Ticket',axis=1)

In [22]:
#train=train.drop('Cabin',axis=1)

In [23]:

#test=test.drop("Ticket",axis=1)

In [24]:
#train.head()

In [25]:
#test.head()

In [26]:
#train['Name'].value_counts()/train.shape[0]

In [27]:
#train=train.drop('Name',axis=1)

In [28]:
#test=test.drop("Name",axis=1)

In [29]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C85,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C123,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,E46,S

In [30]:
#test.head()

In [31]:
from sklearn.preprocessing import LabelEncoder

In [32]:
cv=train.dtypes.loc[train.dtypes=='object'].index
cv=test.dtypes.loc[test.dtypes=='object'].index

In [33]:
cv

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [34]:
train["Name"]=train["Name"].astype('category')
train["Sex"]=train["Sex"].astype('category')
train["Cabin"]=train["Cabin"].astype('category')
train["Embarked"]=train["Embarked"].astype('category')
train["Ticket"]=train["Ticket"].astype('category')
test["Name"]=test["Name"].astype('category')
test["Sex"]=test["Sex"].astype('category')
test["Cabin"]=test["Cabin"].astype('category')
test["Embarked"]=test["Embarked"].astype('category')
test["Ticket"]=test["Ticket"].astype('category')
test["Age"]=test["Age"].astype('category')
test["Fare"]=test["Fare"].astype('category')
train["Age"]=train["Age"].astype('category')
train["Fare"]=train["Fare"].astype('category')

In [35]:
train.dtypes

PassengerId       int64
Survived          int64
Pclass            int64
Name           category
Sex            category
Age            category
SibSp             int64
Parch             int64
Ticket         category
Fare           category
Cabin          category
Embarked       category
dtype: object

In [36]:
test.dtypes

PassengerId       int64
Pclass            int64
Name           category
Sex            category
Age            category
SibSp             int64
Parch             int64
Ticket         category
Fare           category
Cabin          category
Embarked       category
dtype: object

In [37]:
train["Name"]=train["Name"].cat.codes
train["Sex"]=train["Sex"].cat.codes
train["Cabin"]=train["Cabin"].cat.codes
train["Embarked"]=train["Embarked"].cat.codes
train["Ticket"]=train["Ticket"].cat.codes
test["Name"]=test["Name"].cat.codes
test["Sex"]=test["Sex"].cat.codes
test["Cabin"]=test["Cabin"].cat.codes
test["Embarked"]=test["Embarked"].cat.codes
test["Ticket"]=test["Ticket"].cat.codes
test["Age"]=test["Age"].cat.codes
test["Fare"]=test["Fare"].cat.codes
train["Age"]=train["Age"].cat.codes
train["Fare"]=train["Fare"].cat.codes

In [38]:
train.dtypes

PassengerId    int64
Survived       int64
Pclass         int64
Name           int16
Sex             int8
Age             int8
SibSp          int64
Parch          int64
Ticket         int16
Fare           int16
Cabin          int16
Embarked        int8
dtype: object

In [39]:
y_train = train['Survived'].ravel()
train = train.drop(['Survived'], axis=1)
x_train = train.values # Creates an array of the train data
x_test = test.values

In [40]:
from sklearn.tree import DecisionTreeClassifier

In [41]:
#dependent ='Survived'
#independent=[x for x in train.columns if x not in['ID',dependent]]

In [42]:
#initialize the Algorithm
model=DecisionTreeClassifier(max_depth=10,min_samples_leaf=100,max_features='sqrt')

In [43]:
#fit the algorithm
model.fit(x_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=10,
            max_features='sqrt', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=100, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [44]:
train_pred=model.predict(x_train)
test_pred=model.predict(x_test)

In [45]:
from sklearn.metrics import accuracy_score

In [46]:
#determine the train errorore
acc_train=accuracy_score(y_train,train_pred)

In [47]:
print("train accuracy %f"%acc_train)

train accuracy 0.786756

In [48]:
StackingSubmission = pd.DataFrame({ 'PassengerId':test['PassengerId'] ,'Survived': test_pred })
StackingSubmission = StackingSubmission[['PassengerId', 'Survived']]
StackingSubmission.to_csv("StackingSubmission.csv", index=False)